{
  "id": "66",
  "title": "二零一四年二月一日 回忆",
  "text": "都说心情不好的时候就爱回忆过去，那我现在心情一定是差极了。\n盲目自信，自以为我信任的人至少也会抱着最基本的信任来回报吧？一直以来接触的人里最不成熟的就是我，中二没过就把自己从青春的开头封闭到了结尾，以为那些缺失的人生经历不过就是时间。是么？\n曾经我以为是好朋友的她说过：\n你太幼稚。\n是的。能写出字的时候那些心情就已经不在了，或者说已经释怀了。截微博图质问得来的就是这样结果，嘿嘿。能说贴心话的朋友信任一定是基础，我以为是。\n初二下学期刚要开始流行稻香那首曲子的时候，因为被拆班和新同学新老师而融不进去的自己又太个性。脱节，那时候找到的归宿就是网络和计算机。没日没夜的研究小程序，绿色软件，VB编程，家里没网就跑去网吧拿着自己量产的羽詹1GB U盘拷贝好多网络上的VB教程源码，拿回家一点点的copy东拼西凑的写了几十个现在看起来毫无用处的鸡肋程序，研究如何在vista下显示256*256的大图标，怎么给程序加壳 UPS压缩，修改标准资源框体里的其他国家文字改成中文语言，监控安装包修改的文件 注册表项 ，怎么用inf制作绿软安装器 配合7z制作简单的自解压包 后来又研究怎么用inno做常见的安装程序包 然后又手贱把inno又做了一个精简版 那是人生中第一次熬夜到天亮。东西出来之后的充实感这辈子也不会忘记。\n假期结束初三开始，家里人还是给我找了个本地的初中、想让我继续上学，觉得“玩电脑”没出路。\n我所在的城市并不是所谓的市区，郊区的初中 和 市区的初中 并不是一样的初中，当然我也不觉得我适合上学。\n但最后还是去上了那所初中，或许是拗不过妈妈，或许是我想让我有个理由“反正路不是自己选的，今后家里人（妈妈）也不会埋怨太多到我身上”的对自己不负责任，但在觉得妈妈更可怕的那个时候 惯着她们定下的路线更安逸的复杂想法驱使下，还是去上学了。这所学校能见到不少小学时的同学，仿佛看到了中二前的自己。\n初一初二因为考上了离家很远的市重点中学 所以只得住校，突然脱离双亲的束缚，又有机会接触很多新鲜事物，在学校又因为数学和表现上获得老师的称赞、获取到的信息一下让当时的自己与现实脱格。\n自以为是过头，中二的开始。\n好学生、数学课代表、班长、矮个子男生、中二、自以为是、幼稚、不善于察言观色，班级同学对立面的典型。关系好的只有同样身高的女同学。潘虹、闫寒、李芝双 这些年的同学里能清晰记得名字的大概也就个位数。 好奇心满载，精力满载，仿佛多动症 讨厌自己的口音就改说自己以为的普通话，以至于现在东北话都不会说、配合身形经常被以为南方人。\n和班级大部分男生处理不好关系一直延续到初一结束，对我非常好的一位老师 刘琨风老师 因为被举报“惯学生” 被辞退了，剩下学生\n分班。\n一直以来回想到这里常常把这之后一年的经历怪罪到分班上，其实大都是怪我自己吧。\n不去适应新环境，自以为是，中二。初二一开始的班级是走读班，我们几个住校生被硬差进的走读班 班主任有三任：\n一个教了我们1个多月、因病辞退，第一次高考结束的初中同学聚餐时闲聊 他们觉得，其实当时是被我气走的；\n第二个是原本的语文老师，新上任 毕业不久 认真又严厉，当班主任之后更是。爱找家长，爱找我家长。一周5次，剩一天多放假。最后被家长和老师一起申请给我转班，从走读班转到住校班；\n紧接着是第三个班级，也是初二的第三个班主任，对转进来的学生偏见还是不小的。特别是不听话又懒散的我。和老师针锋相对是在最后的期末英语考试上，这样结束了在这所学校的两年。\n要说初二的变化，那就是家里了电脑，于是有了自己的qq、注册了一堆网站id，QQ的激励机制也由挂机时间转移到了QQ空间 和 QQ图标 上。也就是非主流文化 火星文文化流行的时候。\n我也赶上了潮流。\n非主流一般都是和QQ空间文化在一起出现的，免费的QQ空间非主流装扮、空间装扮用自定义模块透明flash flash音乐播放器 小窗口youku视频调用参数  空间免费花藤，免费欢迎动画，我第一次接触javascript代码也是那时候，（后来还见过了那些代码的初创）\n沉迷到初二结束前。\n那时候也是刚刚开始所谓入宅，偶然因为在买的计算机杂志附带光盘里面有 niconico 经典歌曲100首。第一首的残酷天使行动纲领听起来特别耳熟，回想起童年的EVA中配 在youku重温，偶尔翻到很多EVA相关的论坛，回想起之前也有类似的宫崎骏映画馆，于是就想我也做个这样的论坛吧？抱着这种想法去了解了不少Discuz、PHPwind自建论坛，但是都需要虚拟主机啊，域名啊什么的 幸好（不幸）有免费的5d6d Discuz托管，低门槛的论坛托管。又是一番折腾，并不注重网站内容，而是去纠结什么美化代码，功能代码，现在看 其实无非HTML，CSS， JavaScript这些前台语言，偶尔调用一些网站提供的现成功能，算是开始研究网站前台的开始。注册一堆.tk域名，reiove.tk后来因为易用性太差，买了自己的第一个域名 totoro123.com 研究备案。\n紧接着免费论坛各种限制、广告的增多，可用性越发下降。同时这时候也认识了咯拉无米，公主，123，F...不少现在依旧关系很好的基友 也开始接触自己搭建论坛 网站，Discuz优化。偶然又试了试类似的blog服务，yo2.cn 搭建了自己的第一个相对独立的blog。不再是托管于社交平台的Qzone，sina博客。当时还只是玩票性质，因为主要经历还在有了自己的独立论坛上，折腾了很多好玩的插件，有意思的代码，慢慢的自己也开始写一些css效果、javascript 效果。网站SEO优化，前端重构其实也就是那时候开始的嘛，慢慢的 现有的论坛程序好像和我想要的论坛不太一样，二次开发也太困难，那时候Discuz从7.1升级到了X系列，模版乱七八糟 重用很低，只修改模版 写插件给Discuz繁琐程度越发高。而且，有了无米提供的虚拟空间，vps之后也想稍微写点自己的东西，开始专心研究php，研究css，那时候写的第一个留言板基本就是代替现在的微博小号。上面有很多自己当时的心情，想法，想说给自己的话、没掺杂任何其他东西。\n不像其他人，学习php只用一周OAQ 那时的自己真的是极其缓慢的在进步，每每实现了什么功能，自己都能开心好一阵，在基友们的小圈子里面炫耀，也认识了不少新的朋友。等到真的计划并且有能力写自己的论坛的时候，sina app engine 出现了，GAE的翻版感觉，但是支持php 于是imoe论坛就搭建在了SAE，在这个论坛上接触了好多好玩的东西，一些简单的JavaScript实现的功能，前端记录cookie，ajax发表评论，什么的 头像偷懒用的还是Gav的公开头像服务，因为同时也在研究wordpress，写过自己的小blog什么的，也用了在当时还算是新技术的不少功能，其实这之后写的东西，很多都是在重复写轮子。。\n...待续",
  "summary": "都说心情不好的时候就爱回忆过去，那我现在心情一定是差极了。",
  "cover": "//ww2.sinaimg.cn/mw1024/a15b4afejw1ed3wzylo3wj21kw11xe1g",
  "color": "121423",
  "click": 0,
  "star": 0,
  "status": 0,
  "created": 1391243332,
  "modified": 1516767799,
  "images": []
}